task_1_cases = [
    {
        "side_1": "5",
        "side_2": "10",
        "result": "Площадь: 50.0\nПериметр: 30.0\n",
    },
    {
        "side_1": "2.5",
        "side_2": "4",
        "result": "Площадь: 10.0\nПериметр: 13.0\n",
    },
    {
        "side_1": "3.5",
        "side_2": "1.5",
        "result": "Площадь: 5.25\nПериметр: 10.0\n",
    },
    {
        "side_1": "1000000",
        "side_2": "2000000",
        "result": "Площадь: 2000000000000.0\nПериметр: 6000000.0\n",
    },
    {
        "side_1": "0.1",
        "side_2": "0.2",
        "result": "Площадь: 0.020000000000000004\nПериметр: 0.6000000000000001\n",
    },
    {
        "side_1": "0",
        "side_2": "5",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "5",
        "side_2": "0",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "0",
        "side_2": "0",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "-5",
        "side_2": "10",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "5",
        "side_2": "-10",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "-5",
        "side_2": "-10",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "abc",
        "side_2": "5",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "5",
        "side_2": "abc",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "abc",
        "side_2": "xyz",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "",
        "side_2": "5",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "5",
        "side_2": "",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "",
        "side_2": "",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "😀",
        "side_2": "5",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "5",
        "side_2": "😂",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
    {
        "side_1": "😀",
        "side_2": "😂",
        "result": "Ошибка: стороны должны быть положительными числами.\n",
    },
]