task_1_cases = [
    {
        "pet_type": "желторотый питон",
        "pet_age": 1,
        "pet_name": "Каа",
        "result": 'Это желторотый питон по кличке "Каа". Возраст: 1 год.\n',
    },
    {
        "pet_type": "кот",
        "pet_age": 2,
        "pet_name": "Барсик",
        "result": 'Это кот по кличке "Барсик". Возраст: 2 года.\n',
    },
    {
        "pet_type": "собака",
        "pet_age": 4,
        "pet_name": "Рекс",
        "result": 'Это собака по кличке "Рекс". Возраст: 4 года.\n',
    },
    {
        "pet_type": "попугай",
        "pet_age": 5,
        "pet_name": "Кеша",
        "result": 'Это попугай по кличке "Кеша". Возраст: 5 лет.\n',
    },
    {
        "pet_type": "хомяк",
        "pet_age": 11,
        "pet_name": "Пушок",
        "result": 'Это хомяк по кличке "Пушок". Возраст: 11 лет.\n',
    },
    {
        "pet_type": "морская свинка",
        "pet_age": 21,
        "pet_name": "Ириска",
        "result": 'Это морская свинка по кличке "Ириска". Возраст: 21 год.\n',
    },
    {
        "pet_type": "шиншилла",
        "pet_age": 22,
        "pet_name": "Снежок",
        "result": 'Это шиншилла по кличке "Снежок". Возраст: 22 года.\n',
    },
    {
        "pet_type": "игуана",
        "pet_age": 25,
        "pet_name": "Спайк",
        "result": 'Это игуана по кличке "Спайк". Возраст: 25 лет.\n',
    },
    {
        "pet_type": "черепаха",
        "pet_age": 34,
        "pet_name": "Тортилла",
        "result": 'Это черепаха по кличке "Тортилла". Возраст: 34 года.\n',
    },
    {
        "pet_type": "кролик",
        "pet_age": 112,
        "pet_name": "Ушастик",
        "result": 'Это кролик по кличке "Ушастик". Возраст: 112 лет.\n',
    },
]
