task_1_cases = [
    {
        "pet_name": "Мухтар",
        "pet": {
            "Вид питомца": "собака",
            "Возраст питомца": 9,
            "Имя владельца": "Павел",
        },
        "result": 'Это собака по кличке "Мухтар". Возраст питомца: 9 лет. Имя владельца: Павел.',
    },
    {
        "pet_name": "Каа",
        "pet": {
            "Вид питомца": "желторотый питон",
            "Возраст питомца": 34,
            "Имя владельца": "Саша",
        },
        "result": 'Это желторотый питон по кличке "Каа". Возраст питомца: 34 года. Имя владельца: Саша.',
    },
    {
        "pet_name": "Барсик",
        "pet": {
            "Вид питомца": "кот",
            "Возраст питомца": 1,
            "Имя владельца": "Анна",
        },
        "result": 'Это кот по кличке "Барсик". Возраст питомца: 1 год. Имя владельца: Анна.',
    },
    {
        "pet_name": "Рекс",
        "pet": {
            "Вид питомца": "собака",
            "Возраст питомца": 2,
            "Имя владельца": "Иван",
        },
        "result": 'Это собака по кличке "Рекс". Возраст питомца: 2 года. Имя владельца: Иван.',
    },
    {
        "pet_name": "Лаки",
        "pet": {
            "Вид питомца": "попугай",
            "Возраст питомца": 5,
            "Имя владельца": "Мария",
        },
        "result": 'Это попугай по кличке "Лаки". Возраст питомца: 5 лет. Имя владельца: Мария.',
    },
    {
        "pet_name": "Снежок",
        "pet": {
            "Вид питомца": "кролик",
            "Возраст питомца": 21,
            "Имя владельца": "Олег",
        },
        "result": 'Это кролик по кличке "Снежок". Возраст питомца: 21 год. Имя владельца: Олег.',
    },
    {
        "pet_name": "Боня",
        "pet": {
            "Вид питомца": "хомяк",
            "Возраст питомца": 22,
            "Имя владельца": "Елена",
        },
        "result": 'Это хомяк по кличке "Боня". Возраст питомца: 22 года. Имя владельца: Елена.',
    },
    {
        "pet_name": "Гоша",
        "pet": {
            "Вид питомца": "черепаха",
            "Возраст питомца": 11,
            "Имя владельца": "Дмитрий",
        },
        "result": 'Это черепаха по кличке "Гоша". Возраст питомца: 11 лет. Имя владельца: Дмитрий.',
    },
    {
        "pet_name": "Буся",
        "pet": {
            "Вид питомца": "кошка",
            "Возраст питомца": 14,
            "Имя владельца": "Наталья",
        },
        "result": 'Это кошка по кличке "Буся". Возраст питомца: 14 лет. Имя владельца: Наталья.',
    },
    {
        "pet_name": "Тоша",
        "pet": {
            "Вид питомца": "крыса",
            "Возраст питомца": 103,
            "Имя владельца": "Алексей",
        },
        "result": 'Это крыса по кличке "Тоша". Возраст питомца: 103 года. Имя владельца: Алексей.',
    },
]
task_1_age_cases = [
    {"age": 1, "result": "год"},
    {"age": 2, "result": "года"},
    {"age": 4, "result": "года"},
    {"age": 5, "result": "лет"},
    {"age": 11, "result": "лет"},
    {"age": 21, "result": "год"},
    {"age": 22, "result": "года"},
    {"age": 25, "result": "лет"},
    {"age": 111, "result": "лет"},
    {"age": 122, "result": "года"},
]
task_2_cases = [
    {
        "start": 0,
        "end": 0,
        "result": {
            0: 1,
        },
    },
    {
        "start": 1,
        "end": 3,
        "result": {
            1: 1,
            2: 4,
            3: 27,
        },
    },
    {
        "start": 3,
        "end": 1,
        "result": {
            3: 27,
            2: 4,
            1: 1,
        },
    },
    {
        "start": -2,
        "end": 2,
        "result": {
            -2: 0.25,
            -1: -1.0,
            0: 1,
            1: 1,
            2: 4,
        },
    },
    {
        "start": -5,
        "end": -3,
        "result": {
            -5: -0.00032,
            -4: 0.00390625,
            -3: -0.037037037037037035,
        },
    },
    {
        "start": 5,
        "end": 3,
        "result": {
            5: 3125,
            4: 256,
            3: 27,
        },
    },
    {
        "start": -1,
        "end": -1,
        "result": {
            -1: -1.0,
        },
    },
    {
        "start": 2,
        "end": -2,
        "result": {
            2: 4,
            1: 1,
            0: 1,
            -1: -1.0,
            -2: 0.25,
        },
    },
]
